<template>
  <div class="q-pa-md">
    <div class="q-gutter-y-md" style="max-width: 100%">
      <q-card>
        <q-tabs
          v-model="tab"
          dense
          class="bg-grey-3 text-grey-7"
          active-color="primary"
          indicator-color="purple"
          align="justify"
        >
          <q-tab name="small" label="Малое отделение" />
          <q-tab name="big" label="Большое отделение" />
        </q-tabs>

        <q-tab-panels v-model="tab" animated>
          <q-tab-panel name="small">
            <div class="row content-center full-height full-width justify-center">
<div class="row items-center column">
  <div class="service-description text-body1 q-mt-md q-mb-md">Малое отделение, рассчитанное на компанию до 8 человек, позволит вам провести тёплый вечер в узком кругу за достаточно скромную цену. Уютный и комфортный интерьер настроят вас расслабляющий лад. Вместимость указана приблизительно, количество человек одновременно прибывающих в сауне не ограничено, но оговаривается с Администрацией заранее.</div>


</div>
  <div class="full-width q-pa-md row justify-around items-center q-gutter-md">
    <q-card v-for="(serviceSmallItem, index4) in serviceSmallItems" :key="index4"
      class="my-card text-white column -center"
      style="background: radial-gradient(circle, #35a2ff 0%, #014a88 100%)"
    >
      <img src="https://cdn.quasar.dev/img/mountains.jpg">
      <q-card-section>
        <div class="text-h6 text-center">{{ serviceSmallItem.title }}</div>
      </q-card-section>
      <q-card-section>
        {{ serviceSmallItem.description }}
      </q-card-section>
    </q-card>
  </div>
  </div>
          </q-tab-panel>

          <q-tab-panel name="big">
            <div class="row content-center full-height full-width justify-center">
<div class="row items-center column">
  <div class="service-description text-body1 q-mt-md q-mb-md">Большое отделение вместимостью в 20-22 человека предусмотрено для шумного отдыха в большой компании. Каждая комната здесь сделана просторной как нигде больше и даже стены внушают атмосферу праздника. Здесь вы можете не только отдохнуть всей семьей, но и организовать встречу с закадычными друзьями или ближе познакомиться с новыми, отметить день рождения, мальчишник, девичник или отпраздновать другую памятную дату.</div>


</div>
  <div class="full-width q-pa-md row justify-around items-center q-gutter-md">
    <q-card v-for="(serviceBigItem, index) in serviceBigItems" :key="index"
      class="my-card text-white"
      style="background: radial-gradient(circle, #35a2ff 0%, #014a88 100%)"
    >
      <img src="https://cdn.quasar.dev/img/mountains.jpg">

      <q-card-section>
        <div class="text-h6 text-center">{{ serviceBigItem.title }}</div>
      </q-card-section>

      <q-card-section>
        {{ serviceBigItem.description }}
      </q-card-section>
    </q-card>
  </div>
  </div>
          </q-tab-panel>
        </q-tab-panels>
      </q-card>
    </div>
  </div>
</template>

<script>
export default {
  data () {
    return {
      tab: 'small',
      serviceSmallItems: [
          {title: 'Бассейн', description: 'Малое отделение, рассчитанное на компанию в 8 человек, позволит вам провести тёплый вечер в узком кругу за достаточно скромную цену. Уютный и комфортный интерьер настроят вас расслабляющий лад. Вместимость указана приблизительно, количество человек одновременно прибывающих в сауне не ограничено, но оговаривается с Администрацией заранее.'},
          {title: 'Парная', img: '', description: 'Парная на берёзовых дровах с двухуровневыми сиденьями позволяет одновременно париться компании из 6 человек. Вы сами можете регулировать уровень влажности в зависимости от предпочтения к сухому либо влажному пару. Также по вашей просьбе мы можем изменять температуру парной в диапазоне от 70 до 140 ̊С. Если пожелаете, устроим вам настоящее пекло в 150 ̊С. Такого жара нет ни в одной парной города! Что бы вы могли отслеживать температуру на стене находятся градусник и измеритель влажности.'},
          {title: 'Комната отдыха', img: '', description: 'В уютной комнате отдыха с симпатичным интерьером и приятной подсветкой расположен телевизор с DVD-проигрывателем, а также стол с посадочными местами на 7-8 человек. Отдыхающим также предоставлены электрочайник и пластиковые стаканчики.'},
          {title: 'Душевая', img: '', description: 'Обширная душевая комната с длинной лавкой, душем и тазиками делает возможными водные процедуры сразу для нескольких человек. Также в душевой, комнате отдыха и прихожей подогреваются полы. По вашей просьбе мы можем выдать вам резиновые тапочки.'},
          {title: 'Балкон', img: '', description: 'В теплое время года вы также сможете насладиться пребыванием на балконе с замечательным видом на цветочную клумбу и огороженную дворовую территорию, где находятся качели и мангал. На балконе расположены две лавки и стол на компанию в 8 человек, а также раковина с холодной водой. Стену украшает живописное панно с пейзажем.'},
      ],
      serviceBigItems: [
          {title: 'Бассейн', img: '', description: 'Огромный и чистый бассейн площадью 4 на 5 метров является самым большим бассейном в саунах нашего города! Оптимальная глубина в 140-150 сантиметров позволяет смело купаться в нём даже детям, но сохраняет возможность прыжков в воду с балкончика для любителей острых ощущений. Для тех, кто не умеет плавать предусмотрен спасательный круг.'},
          {title: 'Парная', img: '', description: 'Вместительная и светлая парная на берёзовых дровах позволяет одновременно париться компании из 8 человек. Вы сами можете регулировать уровень влажности в зависимости от предпочтения к сухому либо влажному пару. Также по вашей просьбе мы можем изменять температуру парной в диапазоне от 70 до 110 ̊С. Что бы вы могли отслеживать температуру на стене находятся градусник и измеритель влажности. Попарившись, вы можете охладить себя ведром воды, с помощью специального приспособления сделанного прямо возле входа в парную.'},
          {title: 'Комната отдыха', img: '', description: 'В обширной и комфортной комнате отдыха расположена столовая зона на 20-22 человека, красочный аквариум, телевизор с DVD-проигрывателем, а также отдельный просторный танцпол, оборудованный лазерной подсветкой и танцевальным шестом. В распоряжении отдыхающих также электрочайник, микроволновая печь и пластиковые стаканчики.'},
          {title: 'Душевая', img: '', description: 'Отдельная душевая с комфортабельным тропическим душем оснащена зеркалом и подставкой под мыльные принадлежности. Рядом также расположено приспособление с ведром холодной воды для того, что бы освежиться в летний день.'},
          {title: 'Прихожая', img: '', description: 'В прихожей находятся большое зеркало, продолговатая скамья и множество вешалок. Рядом вход в отдельную уборную, где помимо прочего есть уединённое место для персонального отдыха с широкой лавкой.'}
      ],
    }
  }
}
</script>

<style lang="stylus" scoped>
.my-card
  width 100%
  max-width 330px
  min-height 600px
.service-description
  max-width 800px
</style>
