<template>
  <div class="q-pa-md">
    <div class="q-gutter-md">
      <q-carousel
        v-model="slide"
        transition-prev="scale"
        transition-next="scale"
        swipeable
        animated
        control-color="white"
        navigation
        padding
        arrows
        height="80vh"
        class="text-white shadow-1 rounded-borders"
        style="background: radial-gradient(circle, #35a2ff 0%, #014a88 100%)"
      >
        <q-carousel-slide v-for="testimonialItem in testimonialItems" :key="testimonialItem[i]" :name="testimonialItem.name" class="column no-wrap flex-center">
          <div class="q-mt-md text-center column items-center">
    <q-avatar square size="200px">
      <img :src="testimonialItem.avatar">
    </q-avatar>
            {{ testimonialItem.text }}
          </div>
        </q-carousel-slide>
      </q-carousel>
    </div>
  </div>
</template>

<script>
export default {
  data () {
    return {
      slide: '1',
      testimonialItems: [
          {avatar: 'https://pp.userapi.com/c846020/v846020543/1597da/bkqVbPSqB7A.jpg', name: '1', userName: 'Корней Чуковский', date: '23.06.1988', time: '18:05', social: 'fab fa-vk', text: 'Был в этой сауне пару раз с друзьями.очень понравилось!в парной не слабая температура,вода в бассейне очень приятная-летняя(не ледяная и не горячая)отдыхали в сауне за еврооптом около 8 школы,так там хлорки в бассейне было столько,что не могли открыть глаза,а здесь вообще не чувствовалась.нам очень понравилось!обязательно еще приедем)))для человек 5-6 само то!хотя нас было человек 9 и нам было пофиг)советую побывать в данной сауне!)'}, 
          {avatar: 'https://pp.userapi.com/c846020/v846020543/1597da/bkqVbPSqB7A.jpg', name: '2', userName: 'Корней Чуковский', date: '23.06.1988', time: '18:05', social: 'fab fa-vk', text: 'Был в этой сауне пару раз с друзьями.очень понравилось!в парной не слабая температура,вода в бассейне очень приятная-летняя(не ледяная и не горячая)отдыхали в сауне за еврооптом около 8 школы,так там хлорки в бассейне было столько,что не могли открыть глаза,а здесь вообще не чувствовалась.нам очень понравилось!обязательно еще приедем)))для человек 5-6 само то!хотя нас было человек 9 и нам было пофиг)советую побывать в данной сауне!)'},  
          {avatar: 'https://pp.userapi.com/c846020/v846020543/1597da/bkqVbPSqB7A.jpg', name: '3', userName: 'Корней Чуковский', date: '23.06.1988', time: '18:05', social: 'fab fa-vk', text: 'Был в этой сауне пару раз с друзьями.очень понравилось!в парной не слабая температура,вода в бассейне очень приятная-летняя(не ледяная и не горячая)отдыхали в сауне за еврооптом около 8 школы,так там хлорки в бассейне было столько,что не могли открыть глаза,а здесь вообще не чувствовалась.нам очень понравилось!обязательно еще приедем)))для человек 5-6 само то!хотя нас было человек 9 и нам было пофиг)советую побывать в данной сауне!)'}, 
          {avatar: 'https://pp.userapi.com/c846020/v846020543/1597da/bkqVbPSqB7A.jpg', name: '4', userName: 'Корней Чуковский', date: '23.06.1988', time: '18:05', social: 'fab fa-vk', text: 'Был в этой сауне пару раз с друзьями.очень понравилось!в парной не слабая температура,вода в бассейне очень приятная-летняя(не ледяная и не горячая)отдыхали в сауне за еврооптом около 8 школы,так там хлорки в бассейне было столько,что не могли открыть глаза,а здесь вообще не чувствовалась.нам очень понравилось!обязательно еще приедем)))для человек 5-6 само то!хотя нас было человек 9 и нам было пофиг)советую побывать в данной сауне!)'},  
          {avatar: 'https://pp.userapi.com/c846020/v846020543/1597da/bkqVbPSqB7A.jpg', name: '5', userName: 'Корней Чуковский', date: '23.06.1988', time: '18:05', social: 'fab fa-vk', text: 'Был в этой сауне пару раз с друзьями.очень понравилось!в парной не слабая температура,вода в бассейне очень приятная-летняя(не ледяная и не горячая)отдыхали в сауне за еврооптом около 8 школы,так там хлорки в бассейне было столько,что не могли открыть глаза,а здесь вообще не чувствовалась.нам очень понравилось!обязательно еще приедем)))для человек 5-6 само то!хотя нас было человек 9 и нам было пофиг)советую побывать в данной сауне!)'},  
          {avatar: 'https://pp.userapi.com/c846020/v846020543/1597da/bkqVbPSqB7A.jpg', name: '6', userName: 'Корней Чуковский', date: '23.06.1988', time: '18:05', social: 'fab fa-vk', text: 'Был в этой сауне пару раз с друзьями.очень понравилось!в парной не слабая температура,вода в бассейне очень приятная-летняя(не ледяная и не горячая)отдыхали в сауне за еврооптом около 8 школы,так там хлорки в бассейне было столько,что не могли открыть глаза,а здесь вообще не чувствовалась.нам очень понравилось!обязательно еще приедем)))для человек 5-6 само то!хотя нас было человек 9 и нам было пофиг)советую побывать в данной сауне!)'},  
          {avatar: 'https://pp.userapi.com/c846020/v846020543/1597da/bkqVbPSqB7A.jpg', name: '7', userName: 'Корней Чуковский', date: '23.06.1988', time: '18:05', social: 'fab fa-vk', text: 'Был в этой сауне пару раз с друзьями.очень понравилось!в парной не слабая температура,вода в бассейне очень приятная-летняя(не ледяная и не горячая)отдыхали в сауне за еврооптом около 8 школы,так там хлорки в бассейне было столько,что не могли открыть глаза,а здесь вообще не чувствовалась.нам очень понравилось!обязательно еще приедем)))для человек 5-6 само то!хотя нас было человек 9 и нам было пофиг)советую побывать в данной сауне!)'},
           {avatar: 'https://pp.userapi.com/c846020/v846020543/1597da/bkqVbPSqB7A.jpg', name: '8', userName: 'Корней Чуковский', date: '23.06.1988', time: '18:05', social: 'fab fa-vk', text: 'Был в этой сауне пару раз с друзьями.очень понравилось!в парной не слабая температура,вода в бассейне очень приятная-летняя(не ледяная и не горячая)отдыхали в сауне за еврооптом около 8 школы,так там хлорки в бассейне было столько,что не могли открыть глаза,а здесь вообще не чувствовалась.нам очень понравилось!обязательно еще приедем)))для человек 5-6 само то!хотя нас было человек 9 и нам было пофиг)советую побывать в данной сауне!)'}, 
          ]
    }
  },
}
</script>