<template>
  <div class="row full-width items-center" style="min-height: 90vh;">
      <div class="col-md-6">
      <q-scroll-area class="shadow-10 q-ml-md" style="height: 85vh; max-width: 90%;">
        <q-card style="background: radial-gradient(circle, #35a2ff 0%, #014a88 100%);" v-for="testimonialItem in testimonialItems" :key="testimonialItem[n]" class="content-center q-ml-xl q-mr-xl q-mt-md q-mb-md q-py-xs text-white">
          
        </q-card>
      </q-scroll-area>
    </div>

      <div class="col-md-6">

      </div>
  </div>
</template>

<script>
export default {
  data () {
    return {
      testimonialItems: [
          {avatar: 'https://pp.userapi.com/c846020/v846020543/1597da/bkqVbPSqB7A.jpg', name: '1', userName: 'Корней Чуковский', date: '23.06.1988', time: '18:05', social: 'fab fa-vk', text: 'Был в этой сауне пару раз с друзьями.очень понравилось!в парной не слабая температура,вода в бассейне очень приятная-летняя(не ледяная и не горячая)отдыхали в сауне за еврооптом около 8 школы,так там хлорки в бассейне было столько,что не могли открыть глаза,а здесь вообще не чувствовалась.нам очень понравилось!обязательно еще приедем)))для человек 5-6 само то!хотя нас было человек 9 и нам было пофиг)советую побывать в данной сауне!)'}, 
          {avatar: 'https://pp.userapi.com/c846020/v846020543/1597da/bkqVbPSqB7A.jpg', name: '2', userName: 'Корней Чуковский', date: '23.06.1988', time: '18:05', social: 'fab fa-vk', text: 'Был в этой сауне пару раз с друзьями.очень понравилось!в парной не слабая температура,вода в бассейне очень приятная-летняя(не ледяная и не горячая)отдыхали в сауне за еврооптом около 8 школы,так там хлорки в бассейне было столько,что не могли открыть глаза,а здесь вообще не чувствовалась.нам очень понравилось!обязательно еще приедем)))для человек 5-6 само то!хотя нас было человек 9 и нам было пофиг)советую побывать в данной сауне!)'},  
          {avatar: 'https://pp.userapi.com/c846020/v846020543/1597da/bkqVbPSqB7A.jpg', name: '3', userName: 'Корней Чуковский', date: '23.06.1988', time: '18:05', social: 'fab fa-vk', text: 'Был в этой сауне пару раз с друзьями.очень понравилось!в парной не слабая температура,вода в бассейне очень приятная-летняя(не ледяная и не горячая)отдыхали в сауне за еврооптом около 8 школы,так там хлорки в бассейне было столько,что не могли открыть глаза,а здесь вообще не чувствовалась.нам очень понравилось!обязательно еще приедем)))для человек 5-6 само то!хотя нас было человек 9 и нам было пофиг)советую побывать в данной сауне!)'}, 
          {avatar: 'https://pp.userapi.com/c846020/v846020543/1597da/bkqVbPSqB7A.jpg', name: '4', userName: 'Корней Чуковский', date: '23.06.1988', time: '18:05', social: 'fab fa-vk', text: 'Был в этой сауне пару раз с друзьями.очень понравилось!в парной не слабая температура,вода в бассейне очень приятная-летняя(не ледяная и не горячая)отдыхали в сауне за еврооптом около 8 школы,так там хлорки в бассейне было столько,что не могли открыть глаза,а здесь вообще не чувствовалась.нам очень понравилось!обязательно еще приедем)))для человек 5-6 само то!хотя нас было человек 9 и нам было пофиг)советую побывать в данной сауне!)'},  
          {avatar: 'https://pp.userapi.com/c846020/v846020543/1597da/bkqVbPSqB7A.jpg', name: '5', userName: 'Корней Чуковский', date: '23.06.1988', time: '18:05', social: 'fab fa-vk', text: 'Был в этой сауне пару раз с друзьями.очень понравилось!в парной не слабая температура,вода в бассейне очень приятная-летняя(не ледяная и не горячая)отдыхали в сауне за еврооптом около 8 школы,так там хлорки в бассейне было столько,что не могли открыть глаза,а здесь вообще не чувствовалась.нам очень понравилось!обязательно еще приедем)))для человек 5-6 само то!хотя нас было человек 9 и нам было пофиг)советую побывать в данной сауне!)'},  
          {avatar: 'https://pp.userapi.com/c846020/v846020543/1597da/bkqVbPSqB7A.jpg', name: '6', userName: 'Корней Чуковский', date: '23.06.1988', time: '18:05', social: 'fab fa-vk', text: 'Был в этой сауне пару раз с друзьями.очень понравилось!в парной не слабая температура,вода в бассейне очень приятная-летняя(не ледяная и не горячая)отдыхали в сауне за еврооптом около 8 школы,так там хлорки в бассейне было столько,что не могли открыть глаза,а здесь вообще не чувствовалась.нам очень понравилось!обязательно еще приедем)))для человек 5-6 само то!хотя нас было человек 9 и нам было пофиг)советую побывать в данной сауне!)'},  
          {avatar: 'https://pp.userapi.com/c846020/v846020543/1597da/bkqVbPSqB7A.jpg', name: '7', userName: 'Корней Чуковский', date: '23.06.1988', time: '18:05', social: 'fab fa-vk', text: 'Был в этой сауне пару раз с друзьями.очень понравилось!в парной не слабая температура,вода в бассейне очень приятная-летняя(не ледяная и не горячая)отдыхали в сауне за еврооптом около 8 школы,так там хлорки в бассейне было столько,что не могли открыть глаза,а здесь вообще не чувствовалась.нам очень понравилось!обязательно еще приедем)))для человек 5-6 само то!хотя нас было человек 9 и нам было пофиг)советую побывать в данной сауне!)'},
          {avatar: 'https://pp.userapi.com/c846020/v846020543/1597da/bkqVbPSqB7A.jpg', name: '8', userName: 'Корней Чуковский', date: '23.06.1988', time: '18:05', social: 'fab fa-vk', text: 'Был в этой сауне пару раз с друзьями.очень понравилось!в парной не слабая температура,вода в бассейне очень приятная-летняя(не ледяная и не горячая)отдыхали в сауне за еврооптом около 8 школы,так там хлорки в бассейне было столько,что не могли открыть глаза,а здесь вообще не чувствовалась.нам очень понравилось!обязательно еще приедем)))для человек 5-6 само то!хотя нас было человек 9 и нам было пофиг)советую побывать в данной сауне!)'}, 
          ],
    }
  },
}
</script>

<style scope>



</style>